In [78]:
import warnings
warnings.filterwarnings("ignore")

# importing libraries
import numpy as np
import pandas as pd

#cambiar la ruta de su archivo csv
#data=pd.read_excel("//Volumes//MacSSD//Users//alex//vector1.xlsx", sheet_name='vector1', index_col=None, header=None)
data=pd.read_csv("//Volumes//MacSSD//Users//alex//vector1.csv", encoding ='ISO-8859-1', index_col=None, header=None)
#data=pd.DataFrame([19, 61, 29, 89, 7, 97, 56, 87, 5, 41, 46, 67, 98, 32, 13, 44, 6, 20, 24, 42, 73, 91, 53, 64, 78, 22, 90, 45, 54, 77, 96, 88, 50, 36, 37, 71, 57, 81, 55, 3, 25, 39, 49, 99, 35, 51, 1, 69, 43, 58])
#mostrar
data

#print(data)
#print(data.T)

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
0,19,61,29,89,7,97,56,87,5,41,...,25,39,49,99,35,51,1,69,43,58

In [79]:
data.iloc[0,0]=999
data.iloc[0,1]=999
data

#print(data)
#print(data.T)

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
0,999,999,29,89,7,97,56,87,5,41,...,25,39,49,99,35,51,1,69,43,58

In [239]:
#https://www.freecodecamp.org/espanol/news/eliminar-la-lista-de-filas-del-dataframe-de-pandas/
#index - la lista de filas a eliminar
#axis=0 denota que son filas lo que hay que eliminar
#inplace=True realiza la operación sobre el mismo DataFrame
#data.drop([1], axis=1, inplace=True)

#eliminar columnas
#del(data['19'])

#data.drop(['19'], axis = 'columns', inplace=True)

#eliminar por indice MO FUNCIONa
#data = data.drop([0, 1])

#data = data.drop(columns=['19'], inplace=True)

In [240]:
#data.to_numpy().tolist() #.transpose() #tolist()

#dataframe a lista
#data.to_numpy().tolist()

#lista a dataframe
#df_list = data.to_numpy().tolist()
#columns_names = data.columns.values
#pd.DataFrame(df_list, columns=columns_names)

#data.dtypes
#print(data)

In [57]:
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html

#data['tmp2'] = True
#data = data.replace('1','999')
#data = data.replace(['19'],'1')
#data = data.replace(['tmp'],'1')
#data.drop(['tmp2'], axis = 'columns', inplace=True)

#data.iloc[0,0]=1
#data.iloc[0,46]=19
#print(data)

#print(data.iat[0,1])
#print(data.iloc[0,1])

#print(data)